dict() - Создание словаря.
len() - Возвращает число пар.
clear() - Удаляет все значения из словаря.
copy() - Создает псевдокопию словаря.
deepcopy() - Создает полную копию словаря.
fromkeys() - Создание словаря.
get() - Получить значение по ключу.
has_key() - Проверка значения по ключу.
items() - Возвращает список знаечений.
iteriyems() - Возвращает итератор.
keys() - Возвращает список ключей.
iterkeys() - Возвращает итератор ключей.
pop() - Извлекает (удаляет) значение по ключу.
values() - Возвращает значение.
