list.append(x) - Добавляет элемент в конец списка.
list.extend(L) - асширяет список list, добавляя в конец все элементы списка L.
list.insert(i, x) -  Всставляет на i-ный элемент значение х.
list.remove(x) - Удаляет первый элемент в списке, имеющий значение х. Value error, если такого элемента не существует.
list.pop([i]) - Удаляет i-ый элемент и возвращает его. Если индекс не указан, удаляет последний элемент.
list.index(x, [start[, end]]) - Возвращает положение первого элемента со значением х (поиск ведется от start до end).
list.count(x) - Возвращает количество элементов со значением х.
list.sort([key=функция]) - Сортирует список на основе функции.
list.reverse() - Разворачивает
list.copy() - Поверхностная копия
list.clear() - Очистка


