# n = input('Введите степень возведения числа: ')
# print(2 ** int(n))
# print('-' * 20)

# Выведите длину гипотенузы в прямоугольном треугольнике со сторонами 179 и 971.
# Теорема Пифагора: квадрат гипотенузы равен сумме квадратов катетов.
import math

a = 179
b = 971
c1 = a ** 2 + b ** 2
c = math.sqrt(c1)
print(c)
a = -10
print(10 + abs(a))
a = -10
b = -30
print(abs(a) - abs(b))
a = 1
b = '1'
print(a + int(b))
a = 1
b = '1'
print(str(a) + b)
a = '5'
b = 2
print(int(a) + b)
print(a + str(b))
print(a, b)
print(12/43)
a = 12
b = 43
print(a/b)
c = a / b
# print(int(c))
print(round(c))
# x = input('Введите любое число: ')
# f = 2 * float(x) ** 2 + 8 * float(x)
# print(f)
# print(round(f))
a = 8
b = 0.6
c = a * b
print(c)
print(round(c))
print(int(c))
# n = input('Введите любой текст: ')
# print(len(n))
# n = input('Введите любой текст: ').split('f')
# print(len(n))


